angularcallbacks7({
		"formIntro": "The City of Toronto's Festivals & Events Calendar is designed to support citywide festivals, special events and exhibits by informing visitors and residents of what's happening in Toronto throughout the year.                 These events are listed directly on <a target='_blank' href='http://toronto.ca'>toronto.ca</a> and the information is available to third-parties to develop their own event listings through an Open Data feed available at <a target='_blank' href='http://toronto.ca/open'>toronto.ca/open</a>.                 </p>                <p>We invite you to submit your event to be included in the City of Toronto's Festivals & Events Calendar.</p>                <p><strong>Submission Process</strong>                    <ol>                    <li>Ensure your event meets the Event Criteria listed below.</li>                      <li>Ensure your event has not already been posted (to avoid duplication).</li>                    <li>Read and consent to the Terms of Use.</li>                    <li>Once your application has been submitted, it will be reviewed by the Calendar Administrator.</li>                    <li>If your event meets the Event Criteria, your submission will be posted within two weeks of your submission date.</li>                    </ol>                </p>",
		"eventCriteria" : "<p>The City of Toronto reserves the right to edit/exclude event listings. This Festivals & Events Calendar is managed by the <a target='_blank' href='http://www1.toronto.ca/wps/portal/contentonly?vgnextoid=3a7132d0b6d1e310VgnVCM10000071d60f89RCRD'>City of Toronto's Tourism Services</a> <strong>with an objective to promote festivals, events and exhibits that are of interest to residents and tourists discovering Toronto</strong>. All events must meet the Event Criteria outlined below. Note: at the discretion of the Calendar Administrator and Management, events meeting the Event Criteria may be rejected.</p>                <p>To ensure that we are able to process festivals, events and exhibits that are of interest to residents and tourists in a timely manner, we do not accept seminars, workshops and consumer show submissions to the Festivals & Events Calendar unless they are generators of significant visitor numbers.</p>                <ol>                                <li>Events must take place within the <a target='_blank' class='blink' href='//www1.toronto.ca/wps/portal/contentonly?vgnextoid=2ca5045b4f870410VgnVCM10000071d60f89RCRD'>boundaries of the City of Toronto</a>. Multi-venue events with some locations outside of Toronto may be accepted at the discretion of the Calendar Administrators provided that the majority of locations are within the city's limits.<br>                </li>                <li>Events must be open to all members the public.</li>                <li>A title sponsor that is included in the event name will be allowed in your listing. You will also have the opportunity to identify a presenting or producing partner, but sponsor logos will not be accepted.</li>                <li>Both free and ticketed events are eligible. Definition of a free festival, special event or exhibit: if admission to, or attendance at, the event or function, whether it is held inside or outside, is free of charge. Minimal charges for on-site food, additional events/concerts contained within the boundaries of the event or function may be allowed.</li>               <li>Retail promotions and events are not eligible. Definitions include events hosted by retail stores, including the advertising of a business, sidewalk sale, store sale, store liquidation or dining special.</li>                <li>Events must be time specific and must include a start date and end date.</li>                <li>Events must be held in a physical location that can be accessed by the public. For example, online contests or recruitment events will not be accepted.</li>                                <li>For your event to qualify as <a target='_blank' href='https://www.ontario.ca/page/accessibility-laws'>accessible</a>, at minimum your event venue/location must offer a level or ramped access to the entrance and an accessible door width; accessible interior path of travel to all levels, key features and activities; and where washrooms are provided, the washroom has an accessible door width and grab bars.</li>                <li>Events shall not promote hatred or derision of any group and shall not discriminate on any grounds covered by the <a target='_blank' class='blink' href='https://www.ontario.ca/laws/statute/90h19'>Ontario Human Rights Code</a> or the <a target='_blank' class='blink' href='http://www1.toronto.ca/wps/portal/contentonly?vgnextoid=22d8b644b8370410VgnVCM10000071d60f89RCRD&vgnextchannel=19c77d353c460410VgnVCM10000071d60f89RCRD'>City’s Non- Discrimination Policy</a>, including but not limited to race, ancestry, place of origin, colour, ethnic origin, citizenship, creed, sex, sexual orientation, age, marital status, family status, ability, receipt of public assistance, level of literacy or political affiliation. In the event that the City becomes aware of any violation of these principles, the event will immediately be removed from the City of Toronto's Festivals & Events Calendar without notice and without penalty.</li></ol><br><p>For questions related to this calendar please contact <a href='mailto:spevcal@toronto.ca'>spevcal@toronto.ca</a>. For additional support and resources for your event please visit the <a target='_blank' href='http://www.toronto.ca/special_events/event-support'>City of Toronto Special Events Planning Guide.</a></p>                <hr width='100%' size='2' align='left'>",
		"eventTerms" : "<p>To proceed with the application for registration of your event on the City of Toronto’s Events Calendar, you must read and consent to the Terms of Use.</p>                <ol>                <li>General <br>                By using this website to apply for registration of your event on the City of Toronto Events Calendar (the 'Site'), you agree to the current version of these Terms of Use (the 'Terms'). The City of Toronto (the 'City') may change the Terms at any time without notice. The changed Terms will be posted on the Site, and you should read them before using the Site.                 </li>                <li>Information on the site <br>                The City operates the Site as a service to anyone wishing to post their event or festival on the City of Toronto Events Calendar. The City makes every effort to ensure the accuracy and completeness of the information on the Site but does not guarantee the accuracy and completeness. You agree to accept the information found on the Site “as is” and, if you rely on the information, it is at your own risk.                 </li>                <li>Links to other sites<br>                 The Site may have links to external sites and the City is not responsible for the information found there. External sites may have their own terms of use that you must follow. The City’s privacy statement does not apply on external sites. If you gain access to external sites through links on the Site, you do so at your own risk. The City does not endorse sites found through links on the Site, and is not necessarily associated with those sites.                 </li>                           <li>Copyright <br>                Other than the information you may submit to the City for inclusion on the City of Toronto Events Calendar, the text, images and data on the Site (the 'Content') are protected by the Canadian Copyright Act. The City grants you a personal non-exclusive licence to read, download and print copies of the Content. You may reproduce the Content of the Site for non-commercial purposes, if you cite the City as the source. This citation must refer to the City’s copyright and include the web address where the Content was located. If Content on the Site refers to the copyright of another person or organization, you must get written permission from the owner of that copyright before making use of that Content. You do not gain any ownership rights to any of the Content when you gain access to through the Site.                 </li>                <li>Collection, Use and Disclosure of Personal Information<br>                The Municipal Freedom of Information and Protection of Privacy Act (the 'Act') applies to all information collected by the City. The information will only be collected, used and disclosed in accordance with the Act. Please refer to the City’s privacy and security policy for more information                </li>                <li>Copyright Representation and Indemnity <br>                I agree that by submitting the application for registration of an event on the City of Toronto Events Calendar, I am giving the City permission to reproduce, for the purpose of the Calendar, any text and/or photographs I have submitted as part of the application. I represent and warrant that I have the authority to give this permission and that giving this permission does not infringe any other person’s rights in the text and/or the photographs. I agree to indemnify, defend and hold the City and its officials, employees, agents and representatives harmless from any liability, loss, claim and expense, including reasonable lawyer's fees, any of them suffers as a result of a breach of such representation or warranty.                </li>                <li>Other terms <br>                    To use the Site, you also agree to the following terms:                    <ol id='othTerms'>                    <li>You will not change any information or material found on the Site including any information posted by other users; </li>                    <li>You will not violate (or try to violate) the security of the Site by hacking, cracking, mail bombing, mounting a denial of service attack, breaching of netiquette, or any other similar malicious, careless or negligent acts;                     </li>                    <li>You will not impersonate any other person or entity or make any misrepresentations;                     </li>                    <li>You will not upload any content that is unlawful, harmful, threatening, vulgar, obscene, libellous or otherwise objectionable and that may invade another's right of privacy;                     </li>                    <li>You agree that the City is not responsible for any loss, damage, or injury that you may experience as a result of using the Site including, but not limited to, situations caused by viruses or other technical problems;                     </li>                    <li>You agree to be bound by Ontario laws in your use of the Site and you agree that any court proceedings relating to your use of the Site will take place in Ontario; and                     </li>                    <li>You agree that even if the City does not insist on or enforce an item in the Terms, the City still has the right to insist on and enforce that item.</li></ol></li></ol>",
		"formContactInfo" : "For questions related to this calendar please contact <a href='mailto:spevcal@toronto.ca'>spevcal@toronto.ca</a>. For additional support and resources for your event please visit the <a href='http://www.toronto.ca/special_events/event-support'>City of Toronto Special Events Planning Guide</a>.",
		"eventName" :"",
		"description" : "750 characters maximum",
		"eventWebsite" : "",
		"eventEmail" : "",
		"eventPhone" : "",
		"eventPhoneExt" : "",
		"partnerType": "",
		"partnerName" : "",
		"expectedPeak" : "These numbers are for administrative purposes only and will not appear on your event listing",
		"avgAttendance" : "For administrative purposes, what is the estimated number of people expected to attend your event?",
		"category" : "When selecting 'Canada 150', please first ensure you meet the following <a target='_blank' href='//tobesupplied'>criteria</a>",
		"theme" : "",
		"sportsSubcategory" : "",
		"accessibility" : "For your event to qualify as accessible, at minimum your event venue/location must offer a level or ramped access to the entrance and an accessible door width; accessible interior path of travel to all levels, key features and activities; and where washrooms are provided, the washroom has an accessible door width and grab bars.",
		"availableFeatures" : "",
		"alcoholServed" : "Submitting/displaying events on this calendar does not result in request or approval for any permits or permissions that may be legally required to host an event (i.e. liquor license, road closures, etc.). For more information, please contact <a target='_blank' href='http://toronto.ca/311'>toronto.ca/311</a>.",
		"frequency" : "",
		"startDateTime" : "",
		"endDateTime" : "",
		"startDate" : "",
		"endDate" : "",
		"occurDesc" : "",
		"occurStartDateTime" : "",
		"occurEndDateTime" : "",
		"weeklyDesc" : "",
		"dayOfWeek" : "",
		"timepickStart" : "",
		"timepickEnd" : "",
		"timeInfo" : "750 characters maximum",
		"locInstructions" : "Your event, festival or exhibit must take place within Toronto's <a target='_blank' href='http://www1.toronto.ca/wps/portal/contentonly?vgnextoid=2ca5045b4f870410VgnVCM10000071d60f89RCRD'>boundaries</a>. Multi-venue events with some locations outside of Toronto may be accepted for submission at the discretion of the Calendar Administrators, but only those within the boundaries may be mapped for display.<br><br><b>How to add your location(s):</b><ol><li>Add your venue name and the street address for Location 1.</li><li>If required, select 'Display Address' and customize the display.</li><li>If your event has more than one location, fill in the required fields for the first location and then click 'Add Another Event Location.'</li></ol><br>For events not located at a street address or intersection, additional Google Maps drawing features are available by clicking 'Advanced Location' below.",
		"locReminder" : "",		
		"locationName" :"",
		"address" : "",
		"displayAddress" : "If you'd like your location to be displayed to the public with different or more details than a street address, click the check box and type in your display address. Once selected the address field will only be use to map your location. It will not be displayed.",
		"mapInstructions" : "Using standard Google map drawing tools, you can <b>ADD</b> new locations. Add map markers, polylines or polygon areas to the map. Once the shape is added, type in your venue/location name and display address in the fields above. You can also click on an existing map marker or shape and move it as desired, but be aware that the address field will also change.",
		"freeEvent" : "",
		"cost": "",
		"reservations" : "",
		"otherCostInfo" : "750 characters maximum",
		"ImageAltText" : "Describe the image for accessibility purposes",
		"ImageCredit" : "Credit for the image will be displayed in the event listing",
		"ImageInstructions" : "By uploading an image you are indicating that you have the authority to do so and are giving the City of Toronto copyright permission to reproduce the image for the purpose of promoting your festival, special event or exhibit to the public and that giving this permission does not infringe any other person's rights.<br><br>Add an image that best represents your event. The image must be:<ul><li>jpg, jpeg, gif, png</li><li>minimum dimensions of 360(w) x 240(h) pixels</li><li>width:height aspect ratio of 3:2</li><li>must be under 2MB in file size</li></ul>",
		"orgInstructions" : "This information will not be displayed on your public event page.",
		"orgName" : "",
		"contactName" : "",
		"contactTitle" : "",
		"orgAddress": "",
		"orgPhone": "",
		"orgPhoneExt": "",
		"orgFax" : "",
		"orgEmail" : "",
		"orgType" : "",
		"orgTypeOther": "test",
		"featuredEvent" : "",
		"includeInNewsletter" : "",
		"newsLetterCategory": "",
		"newsLetterSubcategory" : "",
		"reviewerComments" : "750 characters maximum"
}
);