odetCallBack({"accessibility":"Not Applicable","application":"Call nearest local office (see separate entries) to arrange a meeting or <a href=\"http://www.mcss.gov.on.ca/en/mcss/programs/social/apply_online.aspx\">apply online</a> * those in need of immediate assistance should apply for Ontario Works -- see separate entry Toronto. Employment and Social Services","eligibilityNotes":"<b>Income Support</b><br> \nAdults 18 years and older with a verified physical or mental disability expected to last a year or more * must live in Ontario and meet financial eligibility criteria\n<br> <br>\n<b>Employment Supports</b><br> Persons 16 years and older with a physical or mental disability expected to last a year or more * must live in Ontario * it is not necessary to be receiving ODSP income support to be eligible for employment supports","executiveContact1":"Ira Matthews, Social Assistance Program Manager","fid":81078,"freePhone":"Information Line 1-888-789-4199 * Disability Adjudication Unit 1-888-256-6758","hours":"Mon-Fri 8:30 am-5 pm","language":"en","lastFullUpdate":"09-Jun-15","lastModified":"16-Dec-15","legalStatus":"Provincial Government","location":"Toronto Downtown Central","mailAddress":"Disability Adjudication Unit,  Box B18, Toronto, ON M7A 1R3","orgId":"MET0828","orgName":"Ontario. Ministry of Community and Social Services. Ontario Disability Support Program","phone":"Disability Adjudication Unit 416-326-5079","serviceAreaCommunities":"Ontario","serviceLanguages":"English; French","serviceLevel":"Provincial Government","services":"<b>Income Supports:</b><br>\nHealth benefits -- prescription drugs * dental care * vision care * medical supplies, including diabetic and surgical supplies * transportation to medical treatment if cost exceeds $15 per month * Pregnancy and Breastfeeding Nutritional Allowance * Extended Health Benefit may be available to clients who are no longer eligible for ODSP income support<br><br>\nDisability-related benefits -- assistive devices including mobility devices, vision and hearing aids, prosthetics * batteries for mobility devices and hearing aids * guide dogs * Special Diet Allowance may be available<br><br>\nEmployment incentives and benefits -- Employment and Training Start-Up Benefit * child care costs  * Work-related benefit * Transitional health benefit * Employment Transition Benefit<br><br>\nHousing-related supports -- Housing Stabilization Fund for rent and energy arrears, rent deposit and essential furniture<br><br>\nTransition Child Benefit - for those not receiving the Ontario Child Benefit or the National Child Benefit Supplement<br><br>\n<b>Employment Supports</b> --  job preparation, job search, starting a business<br><br>\n<b>Interactive Voice Response (IVR) 1-800-808-2268</b>, Mon-Fri 8 am-9 pm, Sat-Sun noon-5 pm -- automated information and payment details, payment history, file status * service not available to TTY users<br><br>\n<b>Welfare Fraud Hotline 1-800-394-7867 </b>--  to report suspected cases of social assistance fraud","web":"www.mcss.gov.on.ca/en/mcss/programs/social/odsp","acc":"N","topics":"YAP028,YAP030,YAP087"});