odetCallBack({"accessibility":"Wheelchair accessible automatic main entrance; Easy access to elevator; Barrier-free washroom including door and stall","accessibilityNotes":"Street parking close to entrance","address":"375 University Ave 5th Fl, Toronto, ON M7A 1G1","executiveContact1":"Karen Turner, Community Program Manager","fax":"416-325-0565","fid":81077,"hours":"Mon-Fri 8:30 am-5 pm","intersection":"University Ave and Dundas St W","language":"en","lastFullUpdate":"28-Mar-14","lastModified":"11-Mar-16","latitude":43.653556,"legalStatus":"Provincial Government","location":"Toronto Downtown Central","longitude":-79.387032,"orgId":"MET0826","orgName":"Ontario. Ministry of Children and Youth Services. Toronto Region Office","phone":"416-325-0500","serviceAreaBoundaries":"City of Toronto","serviceAreaCommunities":"Toronto (City)","serviceLanguages":"English; French","serviceLevel":"Provincial Government","services":"Planning and development of services under the Child and Family Services Act, including child welfare, child treatment, child and family interventions, child development and adoption information * provincial authority for supervising agencies providing these services, including children's aid societies * searchable database of licensed child care centres -- see separate entry for Ontario, Ministry of Education, Toronto Region, Child Care Quality Assurance and Licensing<br><br>\n\n<b>Special Services at Home (SSAH) 416-325-0623 </b>-- financial assistance for the purchase of in-home supports for children with physical and developmental disabilities and for adults with developmental disabilities <br><br>\n\n<b>Assistance for Children with Severe Disabilities Benefit (ACSD) 416-325-0623 or <a href=\"http://www.mcss.gov.on.ca/en/mcss/programs/social/apply_online.aspx\">apply online</a></b> -- financial assistance for families who have children with severe physical and developmental disabilities * monthly amount based on severity of disability, family income and special costs incurred","tty":"416-325-3600","web":"www.children.gov.on.ca","acc":"P","topics":"YAP087"});