odetCallBack({"accessibility":"Unknown","address":"400 University Ave 9th Fl, Toronto, ON M7A 1T7","application":"Call for information or visit district office -- see branch records for locations","email":"webes@ontario.ca","fax":"416-326-7061","fid":81086,"freePhone":"General Inquiry 1-800-531-5551","hours":"Mon-Fri 8:30 am-5 pm","intersection":"University Ave and Dundas St W","language":"en","lastFullUpdate":"18-Mar-14","lastModified":"10-Mar-16","latitude":43.653492,"legalStatus":"Provincial Government","location":"Toronto Downtown Central","longitude":-79.388285,"orgId":"MET0845","orgName":"Ontario. Ministry of Labour. Employment Practices Branch. Main Office","phone":"General Inquiry 416-326-7160","serviceAreaBoundaries":"Ontario","serviceAreaCommunities":"Ontario","serviceLanguages":"English; French","serviceLevel":"Provincial Government","services":"Sets out the rights and responsibilities of employees and employers in Ontario workplaces<br> <br> \n\nAdministers and enforces the <b>Employment Standards Act, 2000</b> <br> <br> \n\nProvides for minimum terms and conditions of employment * sets out maximum number of hours that can be worked in a day or week, minimum daily, weekly or biweekly rest periods, and rules for overtime pay <br> <br> \n\nEstablishes <b>minimum wage</b> -- general rate $11.25 per hour, students under 18 years $10.55 per hour, liquor servers $9.80 per hour * establishes vacation pay and <b>paid public holidays</b> -- New Year's Day, Family Day, Good Friday, Victoria Day, Canada Day, Labour Day, Thanksgiving, Christmas Day, Boxing Day * requires equal pay for equal work <br> <br> \n\nProhibits discrimination on the basis of sex, age or marital status in employer-provided benefit plans * establishes entitlement to pregnancy leave, parental leave, family medical leave, declared emergency leave * 10 days unpaid emergency leave per year (employers with 50 or more employees) * forbids lie detector testing * obliges employers to provide notice of termination or pay in lieu * obliges employers to provide severance pay to terminated employees when applicable * permits retail store workers to refuse work on Sunday and public holidays under particular circumstances * protects the rights of domestic workers and homeworkers * sets out terms and conditions of employment in the women's coat and suit industry and women's dress and sportswear industry<br> <br> \n\n<b>WorkSmartOntario</b>, <a href=\"http://www.worksmartontario.gov.on.ca\">www.worksmartontario.gov.on.ca</a> -- information on employment standards and occupational health and safety for workers under 24 years and new workers","tty":"1-866-567-8893","web":"www.labour.gov.on.ca","acc":"N","topics":"YAP093,YAP097"});